<template>
  <div class="container-fluid main about">
    <h2>{{this[$route.params.page].topic}}</h2>
    <div class="content" v-html="this[$route.params.page].content"></div>
  </div>
</template>
<script>
  export default {
    name: 'about',
    data() {
      return {
        index: {
          topic:'关于必胜公考',
          content:'<p>北京必胜公考教育科技有限公司成立于2015年，致力于服务全国各领域、各学科的备考考生。</p><p>必胜公考通过网站(www.winlesson.com)、移动客户端（必胜公考APP）及微博官方平台（@必胜公考）、微信订阅号（必胜公考科技）组成的在线教育平台和服务体系。</p><p>力求帮助广大在校考生、社会各领域各学科的备考学员，通过互联网和移动客户端获得专业、高效、优质的在线教学课程。</p>',
        },
        contact: {
          topic:'联系我们',
          content:'<p>电话：4000679366</p><p>商务合作邮箱：<a href="mailto:marketing@winlesson.com">marketing@winlesson.com</a></p><p>投递简历邮箱：<a href="mailto:job@winlesson.com">job@winlesson.com</a></p><p>联系地址：北京市朝阳区安立路58号中灿苑2区8号楼</p>',
        },
        service: {
          topic:'用户服务协议',
          content:'<p>欢迎阅读北京必胜公考教育科技有限公司(下称“必胜公考公司”)用户服务协议(下称“本协议”)。本协议阐述之条款和条件适用于您使用本公司的各种工具和服务（下称“服务”） </p><p><strong>1.&nbsp;</strong><strong>应用</strong><strong>服务条款的确认和接纳。</strong></p><p>以任何方式进入本应用即表示您同意自己已经与本公司订立本协议，且您将受本协议的条款和条件(“条款”) 约束。本公司可随时自行全权决定更改“条款”。您应在第一次登录后仔细阅读修订后的“条款”，并有权选择停止继续使用“服务”；一旦您继续使用“服务”，则表示您已接受经修订的“条款”，当您与本应用发生争议时，应以最新的服务协议为准。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。除非经本公司的授权高层管理人员签订书面协议，本协议不得另行作出修订。 </p><p>“必胜公考”ANDROID版适用于操作系统为ANDROID2.2以上版本的智能手机，对于在其他操作系统平台使用本应用可能出现的任何问题，必胜公考公司恕不承担任何责任。“必胜公考”及服务的所有权和运营权以及业务规则及活动的解释权均归必胜公考公司所有。本应用及在提供服务过程中，需经您同意并提供手机位置数据、电话号码等属于您的私人信息，此类信息将仅限于满足您的在线听课服务需求，我方将采取合理的措施保护您的个人隐私，除法律或有法律赋予权限的政府部门要求或您同意等原因外必胜公考公司未经您同意不会向除合作单位以外的第三方公开、透露您的个人隐私。 </p><p>在“必胜公考”应用使用过程中将产生的通信数据流量费用，该服务与费用由您的通信运营商提供，必胜公考公司不提供通信服务和流量费用的收取。 </p><p><strong>2. 本</strong><strong>应用</strong><strong>服务对象。</strong></p><p>“服务”仅提供给能够根据相关法律订立具有法律约束力的合约的个人或公司使用。因此，您的年龄必须在十八周岁或以上，才可使用本公司服务。如不符合本项条件，请勿使用“服务”。本应用可随时自行全权决定拒绝向任何人士提供“服务”。“服务”不会提供给被暂时或永久中止资格的本应用会员。 </p><p><strong>3. </strong><strong>版权声明。 </strong></p><p>必胜公考公司单独拥有或与相关内容提供者共同拥有本应用内所有内容（包括但不限于文字、图片、音频、视频资料及页面设计、编排、软件等）或通过本应用提供产品或服务所涉及到的版权和/或其他相关知识产权。未经必胜公考公司书面许可，任何公司及个人不得复制或在非必胜公考公司所属的服务器上做镜像或以其他任何方式进行使用（包含但不限于抄录、编辑、修改、传播及销售）。已获得书面授权，可以使用必胜公考公司拥有版权和/或其他相关知识产权的任何内容及商标标识的公司及个人使用上述内容时必须注明来源。对于本应用标识等为必胜公考公司的注册商标，受中国法律保护，任何人不得擅自使用。 </p><p><strong>4.&nbsp;</strong><strong>付费。</strong></p><p>必胜公考的线上付费课程，需要您购买才能听课。购买之后系统会自动为您开通课程，开通后即可听课。课程购买后，在该科目本年内考试前可以无限次听课，在本年考试结束以后我们会酌情将课程下线。在次年该科目考试前，我们会更新课程供备考学员听课。 </p><p><strong>5</strong><strong>. 注册义务。</strong></p><p>如您在本应用注册，您同意：(a) 根据会员注册页面所刊载的会员资料表格的要求，提供关于您或贵公司的真实、准确、完整和反映当前情况的资料；(b) 维持并及时更新会员资料，使其保持真实、准确、完整和反映当前情况。倘若您提供任何不真实、不准确、不完整或不能反映当前情况的资料，或本应用有合理理由怀疑该资料不真实、不准确、不完整或不能反映当前情况，本应用有权暂停或终止您的注册身份及资料，并拒绝您在目前或将来对“服务”(或其任何部份) 以任何形式使用。如您代表一家公司或其他法律主体在本公司登记，则您声明和保证，您有权使该公司或其他法律主体受本协议“条款”约束。 </p><p><strong>6</strong><strong>&nbsp;会员注册名、密码和保密。</strong></p><p>在登记过程中，您将选择会员注册名和密码。您须自行负责对您的会员注册名和密码保密，且须对您在会员注册名和密码下发生的所有活动承担责任。您同意：(a) 如发现任何人未经授权使用您的会员注册名或密码，或发生违反保密规定的任何其他情况，您会立即通知本应用；及 (b) 确保您在每个使用时段结束时，以正确步骤离开应用。本应用不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。 </p><p><strong>7</strong><strong>&nbsp;隐私。</strong></p><p>本应用将使用“您的资料”，因此，您必须仔细阅读。请注意，您一旦自愿地在本应用交易地点披露“您的资料”，该等资料即可能被其他人士获取和使用。 </p><p>我们承诺保护访问者和用户的隐私。下面的隐私政策概述了我们处理信息，以及如何利用信息更好地服务使用我们移动应用程序(“应用程序”)以及我们的服务(“服务”)的用户。 </p><p>1.&nbsp;为什么我们收集处理您的个人信息 </p><p>1.1&nbsp;对应用程序的技术和功能管理 </p><p>在某些情况下，应用程序可能会提示您输入您的地理位置，以便我们为您提供增强的体验。有了这些技术数据我们的应用程序管理员可以管理应用程序，例如，通过解决技术困难或改善程序的某些部分的访问。通过这种方式，我们可以确保您可以（持续）以快速和简单的方式获得应用程序信息。 </p><p>1.2&nbsp;客户服务当您在注册为用户，我们将收集您的手机号码。我们将使用您的手机号向您发送一条短信验证码，以确认您的手机号和验证码。我们可能会停用您的帐户，如果我们怀疑您使用我们的应用程序从事欺诈或非法活动，或者违反了我们的使用条款。 </p><p>1.3&nbsp;提升用户体验 </p><p>地理位置信息、 </p><p>当您通过您的移动设备使用应用程序，我们会实时地跟踪您的地理位置信息。我们使用这些信息来允许您查看您所在地区各类考试要求，为您找到更精准的课程。我们也可以使用这种实时地理位置信息，及时解决您在使用应用程序过程中遇到的技术或业务问题。 </p><p>1.4&nbsp; </p><p>市场推广我们会使用您的联系方式给您发送关于我们的新闻、特别优惠和促销活动消息。您可以在任何时候选择不接收这些更新。 </p><p>1.5&nbsp; </p><p>衍生出来的管理信息和统计数据 </p><p>我们以匿名和汇总表方式使用您的个人资料，以密切观察服务的哪些功能是用得最多，分析使用模式，并确定在哪些地方我们应该提供或集中我们的服务。我们会分享这些信息与第三方做行业分析和统计。 </p><p>2.&nbsp; </p><p>我们对您的信息的披露我们可能会聘请第三方公司和个人代表我们提供客户支持，进行网站相关的服务（例如：包括但不限于，维修服务、数据库管理、网络分析和改善网站的功能），或协助我们分析如何使用我们的服务。这些第三方仅会为完成前述工作访问您的个人信息且受到与我们的合同的约束不得披露或将信息用于任何其他目的。 </p><p>在法律许可的范围内，经您同意，我们会透露您的手机号码给我们的合作伙伴以便您获得有关他们产品及服务的信息。 </p><p>3.&nbsp;您的权利 </p><p>作为一个用户，您可以获得您个人帐户信息，包括您所提供给我们的个人信息和通过App </p><p>听课的信息。您可以联系我们的客服在任何时候要求申请更正或删除您的个人信息 </p><p>4.&nbsp;保留 </p><p>除非本隐私和Cookie政策规定，否则，我们将保留您的信息直到您取消帐户，或者直到您的帐户已闲置了一年。如果您希望取消帐户或要求我们不再使用您的信息，请联系我们的客服人员。 </p><p>5.&nbsp;保卫措施&nbsp; </p><p>我们已采取防止您个人资料丢失或被非法处理的适当的技术和安全措施。为了达到这个目的，您的个人资料被安全地储存在我们的数据库中。我们使用标准的、行业通行的、商业上合理的安全措施，如加密，防火墙和SSL（安全接字层）和在保存数据的地方安排安保人员。 </p><p>然而，没有安全系统是不能破解的。我们不能完全保证我们的数据库的不会被攻破，我们也不能保证您提供的信息在互联网上转输时不会被拦截。任何您向我们传输个人信息的风险需要您自行承担。 </p><p>6.&nbsp;政策更新 </p><p>我们会更新本隐私政策，以反映我们变更后的信息操作。我们鼓励您定期查看本页以了解有关我们最新的有关隐私保护的操作。 </p><p><strong>8</strong><strong>. 终止或访问限制。</strong></p><p>您同意，在本应用未向您收费的情况下，本应用可自行全权决定以任何理由 (包括但不限于本应用认为您已违反本协议的字面意义和精神，或您以不符合本协议的字面意义和精神的方式行事，或您在超过90天的时间内未以您的账号及密码登录应用) 终止您的“服务”密码、账户 (或其任何部份) 或您对“服务”的使用，并删除和丢弃您在使用“服务”中提交的 “您的资料”。您同意，在本应用向您收费的情况下，本应用应基于合理的怀疑且经电子邮件通知的情况下实施上述终止服务的行为。本应用同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供“服务”或其任何部份。您同意，根据本协议的任何规定终止您使用“服务”之措施可在不发出事先通知的情况下实施，并承认和同意，本应用可立即使您的账户无效，或撤销您的账户以及在您的账户内的所有相关资料和档案，和/或禁止您进一步接入该等档案或“服务”。账号终止后，本应用没有义务为您保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。 </p><p><strong>9</strong><strong>&nbsp;违反规则会有什么后果？</strong></p><p>在不限制其他补救措施的前提下，发生下述任何一种情况，本公司可立即发出警告，暂时中止、永久中止或终止您的会员资格，删除您的任何现有产品信息，以及您在应用上展示的任何其他资料：(1) 您违反本协议；(2) 本公司无法核实或鉴定您向本公司提供的资料；或 (3) 本公司相信您的行为可能会使您、本应用用户或通过本公司或本公司应用提供服务的第三者服务发生任何法律责任。在不限制任何其他补救措施的前提下，倘若发现您从事涉及本公司应用的诈骗活动，本应用可暂停或终止您的账户。 </p><p><strong>10.</strong><strong>服务“按现状”提供。</strong></p><p>本公司会尽一切努力使您愉快的使用本应用。遗憾的是，本公司不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用“服务”的风险由您自行承担。“服务”以“按现状”和“按可得到”的基础提供。本应用明确声明不做出任何种类的所有明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。本应用对下述内容不作保证：(1)“服务”会符合您的要求；(2)“服务”不会中断，且适时、安全和不带任何错误；(3) 通过使用“服务”而可能获取的结果将是准确或可信赖的；及 (4) 您通过“服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用“服务”而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您从本应用或通过或从“服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证。 </p><p><strong>1</strong><strong>1.</strong><strong>&nbsp;赔偿。</strong></p><p>您同意，因您违反本协议或在此提及的纳入本协议的其他文件，或因您违反了法律或侵害了第三方的权利，而使第三方对本公司及其子公司、分公司、董事、职员、代理人提出索赔要求（包括司法费用和其他专业人士的费用），您必须赔偿给本应用及其分公司、董事、职员、代理人，使其等免遭损失。 </p><p><strong>1</strong><strong>2</strong><strong>. 遵守法律。</strong></p><p>您应遵守与您使用“服务”，遵守与您有关的所有相关的法律、法规、条例和规章。 </p><p><strong>1</strong><strong>3</strong><strong>. 链接。</strong></p><p>“服务”或第三者均可提供与其他万维网应用或资源的链接。由于本应用并不控制该等应用和资源，您承认并同意，本应用并不对该等外在应用或资源的可用性负责，且不认可该等应用或资源上或可从该等应用或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类应用或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，本应用均不承担责任。、本应用的内容或转载内容若涉及版权及其他任何侵权问题，请版权人或其他权利人以书面形式向必胜公考公司反映，并提供相应身份证明、权属证明及详细的侵权情况证明。必胜公考公司提醒您注意：您须保证您的主张和陈述内容的真实性，并对此承担法律责任。 </p><p><strong>1</strong><strong>4</strong><strong>. 通知。</strong></p><p>除非另有明确规定，任何通知应以推送或电子邮件形式发送到您在登记过程中向本应用提供的电子邮件地址，或有关方指明的该等其他地址。在电子邮件发出二十四 (24) 小时后，通知应被视为已送达，除非发送人被告知相关电子邮件地址已作废。 </p><p><strong>1</strong><strong>5</strong><strong>. 不可抗力。</strong></p><p>对于因本公司合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使本公司延迟或未能履约的，本应用不对您承担任何责任。 </p><p><strong>1</strong><strong>6</strong><strong>. 转让。</strong></p><p>本应用转让本协议无需经您同意。 </p><p><strong>1</strong><strong>7</strong><strong>. 其他规定。</strong></p><p>本协议取代您和本应用先前就相同事项订立的任何书面或口头协议。本协议各方面应受中华人民共和国大陆地区法律的管辖。倘若本协议任何规定被裁定为无效或不可强制执行，该项规定应被撤销，而其余规定应予执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。本公司未就您或其他人士的某项违约行为采取行动，并不表明本公司撤回就任何继后或类似的违约事件采取行动的权利。 </p><p>违反上述声明或有其他违法、恶意使用本应用内容者，必胜公考公司保留追究其法律责任的权利。 </p><p><strong>1</strong><strong>8</strong><strong>. 仲裁。</strong></p><p>因本协议或本公司服务所引起或与其有关的任何争议应向北京仲裁委员会申请仲裁。</p>',
        },
        joinus: {
          topic:'招纳贤士',
          content:'<p>你可以是我们的超级老师，年薪百万，享有期权。</p><p>我们迫不及待邀请<b>“考研老师、公务员老师、四六级老师”</b>的快速加入教师团队。</p><p>你可以是90后，热衷教育事业，或有一技之长。</p><p>你就是我们需要的摄像师、动画设计师、帮我们制作剪辑精美的视频课程</p><p>如果你对互联网教育感兴趣，如果你有一颗躁动不安创业的心，别忘了才华需要施展，青春是用来奋斗的，快来加入我们吧！</p><p>投递简历邮箱：<a href="mailto:job@winlesson.com">job@winlesson.com</a></p>',
        },
        responsible: {
          topic:'免责声明',
          content:'<p>1、一切移动客户端用户在下载、浏览、使用必胜公考APP时均被视为已经仔细阅读本条款并完全同意。凡以任何方式登陆本APP，或直接、间接使用本APP资料者，均被视为自愿接受本网站相关声明和用户服务协议的约束。</p><p>2、必胜公考通过APP发布课程内容均为原创，非本产品发布原创内容，如用户观点评论均代表其个人观点，不意味本产品认同其观点或证实其内容真实性。</p><p>3、必胜公考APP客户端发布的文字、图片、音视频等资料内容均由本APP授课教师原创。如被其它第三方机构擅自改编、使用、传播，其真实性、准确性和合法性由第三方信息发布人负责。必胜公考公司不提供任何保证，并不承担任何法律责任。</p><p>4、必胜公考APP客户端不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该外部链接指向的不由必胜公考APP实际控制的任何网页上的内容，必胜公考将不承担任何责任。</p><p>5、用户明确并同意其使用必胜公考APP产品及所提供的网络服务所存在的风险将完全由其本人承担；因其使用必胜公考APP网络服务而产生的一切后果也由其本人承担，必胜公考对此不承担任何责任。</p><p>6、除必胜公考APP产品注明之服务条款外，其它因不当使用本APP而导致的任何意外、疏忽、合约毁坏、诽谤、版权或其他知识产权侵犯及其所造成的任何损失，必胜公考概不负责，亦不承担任何法律责任。</p><p>7、对于因不可抗力或因黑客攻击、通讯线路中断等必胜公考APP不能控制的原因造成的网络服务中断或其他缺陷，导致用户不能正常使用APP产品，必胜公考亦不承担任何责任，但将尽力减少因此给用户造成的损失或影响。</p><p>8、本声明未涉及的问题请参见国家有关法律法规，当本声明与国家有关法律法规冲突时，以国家法律法规为准。</p><p>9、本网站相关声明版权及其修改权、更新权和最终解释权均属必胜公考公司所有。</p>',
        },
        copyright: {
          topic:'版权声明',
          content:'<p>北京必胜公考教育科技有限公司（简称：必胜公考）独立拥有，或与相关内容提供者（如，授课老师）共同拥有必胜公考网站内相关内容（包括但不限于：文字、图片、音频、视频资料及页面设计、编排、软件。）的版权和/或其他相关知识产权。“必胜公考”、“winlesson”、为必胜公考公司及其关联公司的注册商标，受中国法律保护。</p><p>除非中国法律另有规定，未经必胜公考书面许可，对于必胜公考所拥有版权和/或其他知识产权的任何内容，任何人不得复制或在非必胜公考所属的服务器上做镜像或以其他任何方式进行使用；对于“必胜公考”、“winlesson”等商标，任何人不得擅自使用。违反上述声明而给必胜公考公司造成损失的，必胜公考将依法追究其法律责任。</p>',
        }
      }
    }
  }

</script>
<style lang="less">
.about {
  h2 {
    margin-bottom: 40px;
  }
  .content {
    font-size: 14px;
    color: #666;
    p+p {
      margin-top: .5em;
    }
    a {
      color: blue;
      &:hover {
        text-decoration: underline;
      }
    }
  }
}
</style>
